#+title: Exploring gapminder 2
#+author: Marcus Birkenkrahe
#+subtitle: Practice notebook for DSC 205 Spring 2022
#+options: toc:nil ^:nil
#+startup: hideblocks overview
#+property: header-args:R :session *R*
#+property: header-args:R :results output
#+property: header-args:R :exports both
* Checking and getting to know the data

  * [X] Make a copy of ~gapminder~ as ~gm~ so you won't have to do so
    much typing (and also to protect the original data). Check that
    they're identical!

    #+name: identical
    #+begin_src R :exports both :session :results output
      gm <- gapminder
      identical(gm, gapminder)
    #+end_src

    #+RESULTS: identical
    : [1] TRUE

** Rosling's survey

   * [X] This is a famous survey question by Rosling at the start of
     his TED talks: for each of the six pairs of countries below,

     1) which country do you think had the highest child mortality
        rates in 2015? (Measured in infant deaths per 1000)
     2) Which pairs do you think are the most similar?

     Think about this, then fill in the table [[tab:survey]] according to
     your opinion (IM = Infant Mortality per 1000). Put a cross next to
     the country that you think has the highter infant mortality.

     #+name: tab:survey
     | COUNTRY   |   IM | COUNTRY      |   IM |
     |-----------+------+--------------+------|
     | Sri Lanka |  8.4 | Turkey       | 11.6 |
     | Poland    |  4.5 | South Korea  |  2.9 |
     | Malaysia  |  6.0 | Russia       |  8.2 |
     | Pakistan  | 65.8 | Vietnam      | 17.3 |
     | Thailand  | 10.5 | South Africa | 33.6 |

   * [X] Let's run the numbers in the code blocks below, then put the
     results in the table [[tab:survey]] and interpret them.

     The code in [[SriLankaTurkey]] shows
     - two pipes ~%>%~
     - the function ~dplyr::filter~ to filter rows for year and countries
     - the operator ~%in%~ to identify if an element is in a vector
     - the function ~dplyr::select~ to select two column vectors

     #+name: SriLankaTurkey
     #+begin_src R :exports both :session :results output
       gm %>%
         filter(year == 2015 & country %in% c("Sri Lanka", "Turkey")) %>%
         select(country, infant_mortality)
     #+end_src

     #+RESULTS: SriLankaTurkey
     :     country infant_mortality
     : 1 Sri Lanka              8.4
     : 2    Turkey             11.6

   * [X] Put in the code for the other four pairs using a function ~gf~
     that takes the year and the countries as arguments.

     #+name: PolandSouthKorea
     #+begin_src R :exports both :session :results output

     #+end_src

     #+name: MalaysiaRussia
     #+begin_src R :exports both :session :results output

     #+end_src

     #+name: PakistanVietnam
     #+begin_src R :exports both :session :results output

     #+end_src

     #+name: ThailandSouthAfrica
     #+begin_src R :exports both :session :results output

     #+end_src

   * [ ] Extra credit: Write a function that achieves this and test it
     with the five pairs in table [[tab:survey]] - test it and send me the
     solution via email.

   * [X] Solution

     1) start with one argument in the ~filter~ function

        #+name: gf1
        #+begin_src R :exports both :session :results output

        #+end_src

     2) add the other argument in the ~filter~ function

        #+name: gf2
        #+begin_src R :exports both :session :results output

        #+end_src

